yatt122496/stm32_demo_std/模拟电磁曲射炮（全国大学生电子设计大赛）/HARDWARE/VL53L1X/core/vl53l1_register_map.h
	fields: \n
		- [7:4] = accum_reset__clear_stage
		- [3:0] = count_reset__clear_stage
*/
#define VL53L1_GPH_CONFIG__STREAM_COUNT_UPDATE_VALUE                                     0x0044
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['general_config', 'roi_config']

	fields: \n
		- [7:0] = stream_count_update_value
*/
#define VL53L1_GLOBAL_CONFIG__STREAM_DIVIDER                                             0x0045
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['general_config', 'roi_config']

	fields: \n
		- [7:0] = stream_count_internal_div
*/
#define VL53L1_SYSTEM__INTERRUPT_CONFIG_GPIO                                             0x0046
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['general_config', 'gph_config']

	fields: \n
		- [1:0] = int_mode_distance
		- [3:2] = int_mode_rate
		-   [4] = int_spare
		-   [5] = int_new_measure_ready
		-   [6] = int_no_target_en
		-   [7] = int_combined_mode
*/
#define VL53L1_CAL_CONFIG__VCSEL_START                                                   0x0047
/*!<
	type:     uint8_t \n
	default:  0x0B \n
	info: \n
		- msb =  6
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['general_config', 'cal_config']

	fields: \n
		- [6:0] = cal_config__vcsel_start
*/
#define VL53L1_CAL_CONFIG__REPEAT_RATE                                                   0x0048
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 11
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['general_config', 'cal_config']

	fields: \n
		- [11:0] = cal_config__repeat_rate
*/
#define VL53L1_CAL_CONFIG__REPEAT_RATE_HI                                                0x0048
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_CAL_CONFIG__REPEAT_RATE_LO                                                0x0049
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_GLOBAL_CONFIG__VCSEL_WIDTH                                                0x004A
/*!<
	type:     uint8_t \n
	default:  0x02 \n
	info: \n
		- msb =  6
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['general_config', 'global_config']

	fields: \n
		- [6:0] = global_config__vcsel_width
*/
#define VL53L1_PHASECAL_CONFIG__TIMEOUT_MACROP                                           0x004B
/*!<
	type:     uint8_t \n
	default:  0x04 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['general_config', 'phasecal_config']

	fields: \n
		- [7:0] = phasecal_config__timeout_macrop
*/
#define VL53L1_PHASECAL_CONFIG__TARGET                                                   0x004C
/*!<
	type:     uint8_t \n
	default:  0x21 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['general_config', 'phasecal_config']

	fields: \n
		- [7:0] = algo_phasecal_lim
*/
#define VL53L1_PHASECAL_CONFIG__OVERRIDE                                                 0x004D
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['general_config', 'phasecal_config']

	fields: \n
		-   [0] = phasecal_config__override
*/
#define VL53L1_DSS_CONFIG__ROI_MODE_CONTROL                                              0x004F
/*!<
	type:     uint8_t \n
	default:  0x01 \n
	info: \n
		- msb =  2
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['general_config', 'dss_config']

	fields: \n
		- [1:0] = dss_config__input_mode
		-   [2] = calculate_roi_enable
*/
#define VL53L1_SYSTEM__THRESH_RATE_HIGH                                                  0x0050
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['general_config', 'gph_config']

	fields: \n
		- [15:0] = thresh_rate_high (fixed point 9.7)
*/
#define VL53L1_SYSTEM__THRESH_RATE_HIGH_HI                                               0x0050
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_SYSTEM__THRESH_RATE_HIGH_LO                                               0x0051
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_SYSTEM__THRESH_RATE_LOW                                                   0x0052
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['general_config', 'gph_config']

	fields: \n
		- [15:0] = thresh_rate_low (fixed point 9.7)
*/
#define VL53L1_SYSTEM__THRESH_RATE_LOW_HI                                                0x0052
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_SYSTEM__THRESH_RATE_LOW_LO                                                0x0053
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_DSS_CONFIG__MANUAL_EFFECTIVE_SPADS_SELECT                                 0x0054
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['general_config', 'dss_config']

	fields: \n
		- [15:0] = dss_config__manual_effective_spads_select
*/
#define VL53L1_DSS_CONFIG__MANUAL_EFFECTIVE_SPADS_SELECT_HI                              0x0054
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_DSS_CONFIG__MANUAL_EFFECTIVE_SPADS_SELECT_LO                              0x0055
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_DSS_CONFIG__MANUAL_BLOCK_SELECT                                           0x0056
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['general_config', 'dss_config']

	fields: \n
		- [7:0] = dss_config__manual_block_select
*/
#define VL53L1_DSS_CONFIG__APERTURE_ATTENUATION                                          0x0057
/*!<
	type:     uint8_t \n
	default:  0x33 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['general_config', 'dss_config']

	fields: \n
		- [7:0] = dss_config__aperture_attenuation
*/
#define VL53L1_DSS_CONFIG__MAX_SPADS_LIMIT                                               0x0058
/*!<
	type:     uint8_t \n
	default:  0xFF \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['general_config', 'dss_config']

	fields: \n
		- [7:0] = dss_config__max_spads_limit
*/
#define VL53L1_DSS_CONFIG__MIN_SPADS_LIMIT                                               0x0059
/*!<
	type:     uint8_t \n
	default:  0x01 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['general_config', 'dss_config']

	fields: \n
		- [7:0] = dss_config__min_spads_limit
*/
#define VL53L1_MM_CONFIG__TIMEOUT_MACROP_A_HI                                            0x005A
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  3
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['timing_config', 'mm_config']

	fields: \n
		- [3:0] = mm_config__config_timeout_macrop_a_hi
*/
#define VL53L1_MM_CONFIG__TIMEOUT_MACROP_A_LO                                            0x005B
/*!<
	type:     uint8_t \n
	default:  0x06 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['timing_config', 'mm_config']

	fields: \n
		- [7:0] = mm_config__config_timeout_macrop_a_lo
*/
#define VL53L1_MM_CONFIG__TIMEOUT_MACROP_B_HI                                            0x005C
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  3
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['timing_config', 'mm_config']

	fields: \n
		- [3:0] = mm_config__config_timeout_macrop_b_hi
*/
#define VL53L1_MM_CONFIG__TIMEOUT_MACROP_B_LO                                            0x005D
/*!<
	type:     uint8_t \n
	default:  0x06 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['timing_config', 'mm_config']

	fields: \n
		- [7:0] = mm_config__config_timeout_macrop_b_lo
*/
#define VL53L1_RANGE_CONFIG__TIMEOUT_MACROP_A_HI                                         0x005E
/*!<
	type:     uint8_t \n
	default:  0x01 \n
	info: \n
		- msb =  3
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['timing_config', 'range_config']

	fields: \n
		- [3:0] = range_timeout_overall_periods_macrop_a_hi
*/
#define VL53L1_RANGE_CONFIG__TIMEOUT_MACROP_A_LO                                         0x005F
/*!<
	type:     uint8_t \n
	default:  0x92 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['timing_config', 'range_config']

	fields: \n
		- [7:0] = range_timeout_overall_periods_macrop_a_lo
*/
#define VL53L1_RANGE_CONFIG__VCSEL_PERIOD_A                                              0x0060
/*!<
	type:     uint8_t \n
	default:  0x0B \n
	info: \n
		- msb =  5
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['timing_config', 'range_config']

	fields: \n
		- [5:0] = range_config__vcsel_period_a
*/
#define VL53L1_RANGE_CONFIG__TIMEOUT_MACROP_B_HI                                         0x0061
/*!<
	type:     uint8_t \n
	default:  0x01 \n
	info: \n
		- msb =  3
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['timing_config', 'range_config']

	fields: \n
		- [3:0] = range_timeout_overall_periods_macrop_b_hi
*/
#define VL53L1_RANGE_CONFIG__TIMEOUT_MACROP_B_LO                                         0x0062
/*!<
	type:     uint8_t \n
	default:  0x92 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['timing_config', 'range_config']

	fields: \n
		- [7:0] = range_timeout_overall_periods_macrop_b_lo
*/
#define VL53L1_RANGE_CONFIG__VCSEL_PERIOD_B                                              0x0063
/*!<
	type:     uint8_t \n
	default:  0x09 \n
	info: \n
		- msb =  5
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['timing_config', 'range_config']

	fields: \n
		- [5:0] = range_config__vcsel_period_b
*/
#define VL53L1_RANGE_CONFIG__SIGMA_THRESH                                                0x0064
/*!<
	type:     uint16_t \n
	default:  0x0080 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['timing_config', 'range_config']

	fields: \n
		- [15:0] = range_config__sigma_thresh (fixed point 14.2)
*/
#define VL53L1_RANGE_CONFIG__SIGMA_THRESH_HI                                             0x0064
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGE_CONFIG__SIGMA_THRESH_LO                                             0x0065
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGE_CONFIG__MIN_COUNT_RATE_RTN_LIMIT_MCPS                               0x0066
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['timing_config', 'range_config']

	fields: \n
		- [15:0] = range_config__min_count_rate_rtn_limit_mcps (fixed point 9.7)
*/
#define VL53L1_RANGE_CONFIG__MIN_COUNT_RATE_RTN_LIMIT_MCPS_HI                            0x0066
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGE_CONFIG__MIN_COUNT_RATE_RTN_LIMIT_MCPS_LO                            0x0067
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGE_CONFIG__VALID_PHASE_LOW                                             0x0068
/*!<
	type:     uint8_t \n
	default:  0x08 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['timing_config', 'range_config']

	fields: \n
		- [7:0] = range_config__valid_phase_low (fixed point 5.3)
*/
#define VL53L1_RANGE_CONFIG__VALID_PHASE_HIGH                                            0x0069
/*!<
	type:     uint8_t \n
	default:  0x80 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['timing_config', 'range_config']

	fields: \n
		- [7:0] = range_config__valid_phase_high (fixed point 5.3)
*/
#define VL53L1_SYSTEM__INTERMEASUREMENT_PERIOD                                           0x006C
/*!<
	type:     uint32_t \n
	default:  0x00000000 \n
	info: \n
		- msb = 31
		- lsb =  0
		- i2c_size =  4

	groups: \n
		['timing_config', 'system_config']

	fields: \n
		- [31:0] = intermeasurement_period
*/
#define VL53L1_SYSTEM__INTERMEASUREMENT_PERIOD_3                                         0x006C
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_SYSTEM__INTERMEASUREMENT_PERIOD_2                                         0x006D
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_SYSTEM__INTERMEASUREMENT_PERIOD_1                                         0x006E
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_SYSTEM__INTERMEASUREMENT_PERIOD_0                                         0x006F
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_SYSTEM__FRACTIONAL_ENABLE                                                 0x0070
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['timing_config', 'system_config']

	fields: \n
		-   [0] = range_fractional_enable
*/
#define VL53L1_SYSTEM__GROUPED_PARAMETER_HOLD_0                                          0x0071
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  1
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['dynamic_config', 'gph_config']

	fields: \n
		-   [0] = grouped_parameter_hold
		-   [1] = grouped_parameter_hold_id
*/
#define VL53L1_SYSTEM__THRESH_HIGH                                                       0x0072
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['dynamic_config', 'gph_config']

	fields: \n
		- [15:0] = thresh_high
*/
#define VL53L1_SYSTEM__THRESH_HIGH_HI                                                    0x0072
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_SYSTEM__THRESH_HIGH_LO                                                    0x0073
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_SYSTEM__THRESH_LOW                                                        0x0074
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['dynamic_config', 'gph_config']

	fields: \n
		- [15:0] = thresh_low
*/
#define VL53L1_SYSTEM__THRESH_LOW_HI                                                     0x0074
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_SYSTEM__THRESH_LOW_LO                                                     0x0075
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_SYSTEM__ENABLE_XTALK_PER_QUADRANT                                         0x0076
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['dynamic_config', 'gph_config']

	fields: \n
		-   [0] = system__enable_xtalk_per_quadrant
*/
#define VL53L1_SYSTEM__SEED_CONFIG                                                       0x0077
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  2
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['dynamic_config', 'gph_config']

	fields: \n
		- [1:0] = system__seed_config
		-   [2] = system__fw_pause_ctrl
*/
#define VL53L1_SD_CONFIG__WOI_SD0                                                        0x0078
/*!<
	type:     uint8_t \n
	default:  0x04 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['dynamic_config', 'gph_config']

	fields: \n
		- [7:0] = sd_config__woi_sd0
*/
#define VL53L1_SD_CONFIG__WOI_SD1                                                        0x0079
/*!<
	type:     uint8_t \n
	default:  0x04 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['dynamic_config', 'gph_config']

	fields: \n
		- [7:0] = sd_config__woi_sd1
*/
#define VL53L1_SD_CONFIG__INITIAL_PHASE_SD0                                              0x007A
/*!<
	type:     uint8_t \n
	default:  0x03 \n
	info: \n
		- msb =  6
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['dynamic_config', 'gph_config']

	fields: \n
		- [6:0] = sd_config__initial_phase_sd0
*/
#define VL53L1_SD_CONFIG__INITIAL_PHASE_SD1                                              0x007B
/*!<
	type:     uint8_t \n
	default:  0x03 \n
	info: \n
		- msb =  6
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['dynamic_config', 'gph_config']

	fields: \n
		- [6:0] = sd_config__initial_phase_sd1
*/
#define VL53L1_SYSTEM__GROUPED_PARAMETER_HOLD_1                                          0x007C
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  1
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['dynamic_config', 'gph_config']

	fields: \n
		-   [0] = grouped_parameter_hold
		-   [1] = grouped_parameter_hold_id
*/
#define VL53L1_SD_CONFIG__FIRST_ORDER_SELECT                                             0x007D
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  1
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['dynamic_config', 'gph_config']

	fields: \n
		-   [0] = sd_config__first_order_select_rtn
		-   [1] = sd_config__first_order_select_ref
*/
#define VL53L1_SD_CONFIG__QUANTIFIER                                                     0x007E
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  3
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['dynamic_config', 'gph_config']

	fields: \n
		- [3:0] = sd_config__quantifier
*/
#define VL53L1_ROI_CONFIG__USER_ROI_CENTRE_SPAD                                          0x007F
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['dynamic_config', 'gph_config']

	fields: \n
		- [7:0] = user_roi_center_spad
*/
#define VL53L1_ROI_CONFIG__USER_ROI_REQUESTED_GLOBAL_XY_SIZE                             0x0080
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['dynamic_config', 'gph_config']

	fields: \n
		- [7:0] = roi_config__user_roi_requested_global_xy_size
*/
#define VL53L1_SYSTEM__SEQUENCE_CONFIG                                                   0x0081
/*!<
	type:     uint8_t \n
	default:  0xFF \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['dynamic_config', 'gph_config']

	fields: \n
		-   [0] = sequence_vhv_en
		-   [1] = sequence_phasecal_en
		-   [2] = sequence_reference_phase_en
		-   [3] = sequence_dss1_en
		-   [4] = sequence_dss2_en
		-   [5] = sequence_mm1_en
		-   [6] = sequence_mm2_en
		-   [7] = sequence_range_en
*/
#define VL53L1_SYSTEM__GROUPED_PARAMETER_HOLD                                            0x0082
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  1
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['dynamic_config', 'gph_config']

	fields: \n
		-   [0] = grouped_parameter_hold
		-   [1] = grouped_parameter_hold_id
*/
#define VL53L1_POWER_MANAGEMENT__GO1_POWER_FORCE                                         0x0083
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['system_control', 'pwrman_ctrl']

	fields: \n
		-   [0] = go1_dig_powerforce
*/
#define VL53L1_SYSTEM__STREAM_COUNT_CTRL                                                 0x0084
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['system_control', 'stream_ctrl']

	fields: \n
		-   [0] = retain_stream_count
*/
#define VL53L1_FIRMWARE__ENABLE                                                          0x0085
/*!<
	type:     uint8_t \n
	default:  0x01 \n
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['system_control', 'firmware_ctrl']

	fields: \n
		-   [0] = firmware_enable
*/
#define VL53L1_SYSTEM__INTERRUPT_CLEAR                                                   0x0086
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  1
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['system_control', 'system_int_clr']

	fields: \n
		-   [0] = sys_interrupt_clear_range
		-   [1] = sys_interrupt_clear_error
*/
#define VL53L1_SYSTEM__MODE_START                                                        0x0087
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['system_control', 'system_start']

	fields: \n
		- [1:0] = scheduler_mode
		- [3:2] = readout_mode
		-   [4] = mode_range__single_shot
		-   [5] = mode_range__back_to_back
		-   [6] = mode_range__timed
		-   [7] = mode_range__abort
*/
#define VL53L1_RESULT__INTERRUPT_STATUS                                                  0x0088
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  5
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['system_results', 'results']

	fields: \n
		- [2:0] = int_status
		- [4:3] = int_error_status
		-   [5] = gph_id_gpio_status
*/
#define VL53L1_RESULT__RANGE_STATUS                                                      0x0089
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['system_results', 'results']

	fields: \n
		- [4:0] = range_status
		-   [5] = max_threshold_hit
		-   [6] = min_threshold_hit
		-   [7] = gph_id_range_status
*/
#define VL53L1_RESULT__REPORT_STATUS                                                     0x008A
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  3
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['system_results', 'results']

	fields: \n
		- [3:0] = report_status
*/
#define VL53L1_RESULT__STREAM_COUNT                                                      0x008B
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['system_results', 'results']

	fields: \n
		- [7:0] = result__stream_count
*/
#define VL53L1_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD0                                    0x008C
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['system_results', 'results']

	fields: \n
		- [15:0] = result__dss_actual_effective_spads_sd0 (fixed point 8.8)
*/
#define VL53L1_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD0_HI                                 0x008C
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD0_LO                                 0x008D
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD0                                   0x008E
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['system_results', 'results']

	fields: \n
		- [15:0] = result__peak_signal_count_rate_mcps_sd0 (fixed point 9.7)
*/
#define VL53L1_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD0_HI                                0x008E
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD0_LO                                0x008F
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__AMBIENT_COUNT_RATE_MCPS_SD0                                       0x0090
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['system_results', 'results']

	fields: \n
		- [15:0] = result__ambient_count_rate_mcps_sd0 (fixed point 9.7)
*/
#define VL53L1_RESULT__AMBIENT_COUNT_RATE_MCPS_SD0_HI                                    0x0090
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__AMBIENT_COUNT_RATE_MCPS_SD0_LO                                    0x0091
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__SIGMA_SD0                                                         0x0092
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['system_results', 'results']

