yatt122496/stm32_demo_std/模拟电磁曲射炮（全国大学生电子设计大赛）/HARDWARE/VL53L1X/core/vl53l1_register_map.h
	fields: \n
		- [15:0] = result__sigma_sd0 (fixed point 14.2)
*/
#define VL53L1_RESULT__SIGMA_SD0_HI                                                      0x0092
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__SIGMA_SD0_LO                                                      0x0093
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__PHASE_SD0                                                         0x0094
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['system_results', 'results']

	fields: \n
		- [15:0] = result__phase_sd0 (fixed point 5.11)
*/
#define VL53L1_RESULT__PHASE_SD0_HI                                                      0x0094
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__PHASE_SD0_LO                                                      0x0095
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD0                            0x0096
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['system_results', 'results']

	fields: \n
		- [15:0] = result__final_crosstalk_corrected_range_mm_sd0
*/
#define VL53L1_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD0_HI                         0x0096
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD0_LO                         0x0097
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__PEAK_SIGNAL_COUNT_RATE_CROSSTALK_CORRECTED_MCPS_SD0               0x0098
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['system_results', 'results']

	fields: \n
		- [15:0] = result__peak_signal_count_rate_crosstalk_corrected_mcps_sd0 (fixed point 9.7)
*/
#define VL53L1_RESULT__PEAK_SIGNAL_COUNT_RATE_CROSSTALK_CORRECTED_MCPS_SD0_HI            0x0098
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__PEAK_SIGNAL_COUNT_RATE_CROSSTALK_CORRECTED_MCPS_SD0_LO            0x0099
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__MM_INNER_ACTUAL_EFFECTIVE_SPADS_SD0                               0x009A
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['system_results', 'results']

	fields: \n
		- [15:0] = result__mm_inner_actual_effective_spads_sd0 (fixed point 8.8)
*/
#define VL53L1_RESULT__MM_INNER_ACTUAL_EFFECTIVE_SPADS_SD0_HI                            0x009A
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__MM_INNER_ACTUAL_EFFECTIVE_SPADS_SD0_LO                            0x009B
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__MM_OUTER_ACTUAL_EFFECTIVE_SPADS_SD0                               0x009C
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['system_results', 'results']

	fields: \n
		- [15:0] = result__mm_outer_actual_effective_spads_sd0 (fixed point 8.8)
*/
#define VL53L1_RESULT__MM_OUTER_ACTUAL_EFFECTIVE_SPADS_SD0_HI                            0x009C
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__MM_OUTER_ACTUAL_EFFECTIVE_SPADS_SD0_LO                            0x009D
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__AVG_SIGNAL_COUNT_RATE_MCPS_SD0                                    0x009E
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['system_results', 'results']

	fields: \n
		- [15:0] = result__avg_signal_count_rate_mcps_sd0 (fixed point 9.7)
*/
#define VL53L1_RESULT__AVG_SIGNAL_COUNT_RATE_MCPS_SD0_HI                                 0x009E
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__AVG_SIGNAL_COUNT_RATE_MCPS_SD0_LO                                 0x009F
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD1                                    0x00A0
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['system_results', 'results']

	fields: \n
		- [15:0] = result__dss_actual_effective_spads_sd1 (fixed point 8.8)
*/
#define VL53L1_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD1_HI                                 0x00A0
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD1_LO                                 0x00A1
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD1                                   0x00A2
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['system_results', 'results']

	fields: \n
		- [15:0] = result__peak_signal_count_rate_mcps_sd1 (fixed point 9.7)
*/
#define VL53L1_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD1_HI                                0x00A2
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD1_LO                                0x00A3
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__AMBIENT_COUNT_RATE_MCPS_SD1                                       0x00A4
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['system_results', 'results']

	fields: \n
		- [15:0] = result__ambient_count_rate_mcps_sd1 (fixed point 9.7)
*/
#define VL53L1_RESULT__AMBIENT_COUNT_RATE_MCPS_SD1_HI                                    0x00A4
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__AMBIENT_COUNT_RATE_MCPS_SD1_LO                                    0x00A5
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__SIGMA_SD1                                                         0x00A6
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['system_results', 'results']

	fields: \n
		- [15:0] = result__sigma_sd1 (fixed point 14.2)
*/
#define VL53L1_RESULT__SIGMA_SD1_HI                                                      0x00A6
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__SIGMA_SD1_LO                                                      0x00A7
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__PHASE_SD1                                                         0x00A8
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['system_results', 'results']

	fields: \n
		- [15:0] = result__phase_sd1 (fixed point 5.11)
*/
#define VL53L1_RESULT__PHASE_SD1_HI                                                      0x00A8
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__PHASE_SD1_LO                                                      0x00A9
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD1                            0x00AA
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['system_results', 'results']

	fields: \n
		- [15:0] = result__final_crosstalk_corrected_range_mm_sd1
*/
#define VL53L1_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD1_HI                         0x00AA
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD1_LO                         0x00AB
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__SPARE_0_SD1                                                       0x00AC
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['system_results', 'results']

	fields: \n
		- [15:0] = result__spare_0_sd1
*/
#define VL53L1_RESULT__SPARE_0_SD1_HI                                                    0x00AC
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__SPARE_0_SD1_LO                                                    0x00AD
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__SPARE_1_SD1                                                       0x00AE
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['system_results', 'results']

	fields: \n
		- [15:0] = result__spare_1_sd1
*/
#define VL53L1_RESULT__SPARE_1_SD1_HI                                                    0x00AE
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__SPARE_1_SD1_LO                                                    0x00AF
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__SPARE_2_SD1                                                       0x00B0
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['system_results', 'results']

	fields: \n
		- [15:0] = result__spare_2_sd1
*/
#define VL53L1_RESULT__SPARE_2_SD1_HI                                                    0x00B0
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__SPARE_2_SD1_LO                                                    0x00B1
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__SPARE_3_SD1                                                       0x00B2
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['system_results', 'results']

	fields: \n
		- [7:0] = result__spare_3_sd1
*/
#define VL53L1_RESULT__THRESH_INFO                                                       0x00B3
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['system_results', 'results']

	fields: \n
		- [3:0] = result__distance_int_info
		- [7:4] = result__rate_int_info
*/
#define VL53L1_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0                                    0x00B4
/*!<
	type:     uint32_t \n
	default:  0x00000000 \n
	info: \n
		- msb = 31
		- lsb =  0
		- i2c_size =  4

	groups: \n
		['core_results', 'ranging_core_results']

	fields: \n
		- [31:0] = result_core__ambient_window_events_sd0
*/
#define VL53L1_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0_3                                  0x00B4
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0_2                                  0x00B5
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0_1                                  0x00B6
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0_0                                  0x00B7
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0                                     0x00B8
/*!<
	type:     uint32_t \n
	default:  0x00000000 \n
	info: \n
		- msb = 31
		- lsb =  0
		- i2c_size =  4

	groups: \n
		['core_results', 'ranging_core_results']

	fields: \n
		- [31:0] = result_core__ranging_total_events_sd0
*/
#define VL53L1_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0_3                                   0x00B8
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0_2                                   0x00B9
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0_1                                   0x00BA
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0_0                                   0x00BB
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0                                      0x00BC
/*!<
	type:     int32_t \n
	default:  0x00000000 \n
	info: \n
		- msb = 31
		- lsb =  0
		- i2c_size =  4

	groups: \n
		['core_results', 'ranging_core_results']

	fields: \n
		- [31:0] = result_core__signal_total_events_sd0
*/
#define VL53L1_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0_3                                    0x00BC
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0_2                                    0x00BD
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0_1                                    0x00BE
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0_0                                    0x00BF
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0                                    0x00C0
/*!<
	type:     uint32_t \n
	default:  0x00000000 \n
	info: \n
		- msb = 31
		- lsb =  0
		- i2c_size =  4

	groups: \n
		['core_results', 'ranging_core_results']

	fields: \n
		- [31:0] = result_core__total_periods_elapsed_sd0
*/
#define VL53L1_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0_3                                  0x00C0
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0_2                                  0x00C1
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0_1                                  0x00C2
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0_0                                  0x00C3
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1                                    0x00C4
/*!<
	type:     uint32_t \n
	default:  0x00000000 \n
	info: \n
		- msb = 31
		- lsb =  0
		- i2c_size =  4

	groups: \n
		['core_results', 'ranging_core_results']

	fields: \n
		- [31:0] = result_core__ambient_window_events_sd1
*/
#define VL53L1_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1_3                                  0x00C4
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1_2                                  0x00C5
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1_1                                  0x00C6
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1_0                                  0x00C7
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1                                     0x00C8
/*!<
	type:     uint32_t \n
	default:  0x00000000 \n
	info: \n
		- msb = 31
		- lsb =  0
		- i2c_size =  4

	groups: \n
		['core_results', 'ranging_core_results']

	fields: \n
		- [31:0] = result_core__ranging_total_events_sd1
*/
#define VL53L1_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1_3                                   0x00C8
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1_2                                   0x00C9
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1_1                                   0x00CA
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1_0                                   0x00CB
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1                                      0x00CC
/*!<
	type:     int32_t \n
	default:  0x00000000 \n
	info: \n
		- msb = 31
		- lsb =  0
		- i2c_size =  4

	groups: \n
		['core_results', 'ranging_core_results']

	fields: \n
		- [31:0] = result_core__signal_total_events_sd1
*/
#define VL53L1_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1_3                                    0x00CC
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1_2                                    0x00CD
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1_1                                    0x00CE
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1_0                                    0x00CF
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1                                    0x00D0
/*!<
	type:     uint32_t \n
	default:  0x00000000 \n
	info: \n
		- msb = 31
		- lsb =  0
		- i2c_size =  4

	groups: \n
		['core_results', 'ranging_core_results']

	fields: \n
		- [31:0] = result_core__total_periods_elapsed_sd1
*/
#define VL53L1_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1_3                                  0x00D0
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1_2                                  0x00D1
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1_1                                  0x00D2
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1_0                                  0x00D3
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT_CORE__SPARE_0                                                      0x00D4
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['core_results', 'ranging_core_results']

	fields: \n
		- [7:0] = result_core__spare_0
*/
#define VL53L1_PHASECAL_RESULT__REFERENCE_PHASE                                          0x00D6
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['debug_results', 'phasecal_results']

	fields: \n
		- [15:0] = result_phasecal__reference_phase (fixed point 5.11)
*/
#define VL53L1_PHASECAL_RESULT__REFERENCE_PHASE_HI                                       0x00D6
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PHASECAL_RESULT__REFERENCE_PHASE_LO                                       0x00D7
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PHASECAL_RESULT__VCSEL_START                                              0x00D8
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  6
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'phasecal_results']

	fields: \n
		- [6:0] = result_phasecal__vcsel_start
*/
#define VL53L1_REF_SPAD_CHAR_RESULT__NUM_ACTUAL_REF_SPADS                                0x00D9
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  5
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'ref_spad_status']

	fields: \n
		- [5:0] = ref_spad_char_result__num_actual_ref_spads
*/
#define VL53L1_REF_SPAD_CHAR_RESULT__REF_LOCATION                                        0x00DA
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  1
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'ref_spad_status']

	fields: \n
		- [1:0] = ref_spad_char_result__ref_location
*/
#define VL53L1_VHV_RESULT__COLDBOOT_STATUS                                               0x00DB
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'vhv_results']

	fields: \n
		-   [0] = vhv_result__coldboot_status
*/
#define VL53L1_VHV_RESULT__SEARCH_RESULT                                                 0x00DC
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  5
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'vhv_results']

	fields: \n
		- [5:0] = cp_sel_result
*/
#define VL53L1_VHV_RESULT__LATEST_SETTING                                                0x00DD
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  5
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'vhv_results']

	fields: \n
		- [5:0] = cp_sel_latest_setting
*/
#define VL53L1_RESULT__OSC_CALIBRATE_VAL                                                 0x00DE
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb =  9
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['debug_results', 'misc_results']

	fields: \n
		- [9:0] = osc_calibrate_val
*/
#define VL53L1_RESULT__OSC_CALIBRATE_VAL_HI                                              0x00DE
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RESULT__OSC_CALIBRATE_VAL_LO                                              0x00DF
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_ANA_CONFIG__POWERDOWN_GO1                                                 0x00E0
/*!<
	type:     uint8_t \n
	default:  0x02 \n
	info: \n
		- msb =  1
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'analog_config']

	fields: \n
		-   [0] = go2_ref_bg_disable_avdd
		-   [1] = go2_regdvdd1v2_enable_avdd
*/
#define VL53L1_ANA_CONFIG__REF_BG_CTRL                                                   0x00E1
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  1
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'analog_config']

	fields: \n
		-   [0] = go2_ref_overdrvbg_avdd
		-   [1] = go2_ref_forcebgison_avdd
*/
#define VL53L1_ANA_CONFIG__REGDVDD1V2_CTRL                                               0x00E2
/*!<
	type:     uint8_t \n
	default:  0x01 \n
	info: \n
		- msb =  3
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'analog_config']

	fields: \n
		-   [0] = go2_regdvdd1v2_sel_pulldown_avdd
		-   [1] = go2_regdvdd1v2_sel_boost_avdd
		- [3:2] = go2_regdvdd1v2_selv_avdd
*/
#define VL53L1_ANA_CONFIG__OSC_SLOW_CTRL                                                 0x00E3
/*!<
	type:     uint8_t \n
	default:  0x02 \n
	info: \n
		- msb =  2
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'analog_config']

	fields: \n
		-   [0] = osc_slow_en
		-   [1] = osc_slow_op_en
		-   [2] = osc_slow_freq_sel
*/
#define VL53L1_TEST_MODE__STATUS                                                         0x00E4
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'test_mode_status']

	fields: \n
		-   [0] = test_mode_status
*/
#define VL53L1_FIRMWARE__SYSTEM_STATUS                                                   0x00E5
/*!<
	type:     uint8_t \n
	default:  0x02 \n
	info: \n
		- msb =  1
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'firmware_status']

	fields: \n
		-   [0] = firmware_bootup
		-   [1] = firmware_first_range
*/
#define VL53L1_FIRMWARE__MODE_STATUS                                                     0x00E6
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'firmware_status']

