yatt122496/stm32_demo_std/模拟电磁曲射炮（全国大学生电子设计大赛）/HARDWARE/VL53L1X/core/vl53l1_register_map.h
	fields: \n
		- [7:0] = firmware_mode_status
*/
#define VL53L1_FIRMWARE__SECONDARY_MODE_STATUS                                           0x00E7
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'firmware_status']

	fields: \n
		- [7:0] = fw_secondary_mode_status
*/
#define VL53L1_FIRMWARE__CAL_REPEAT_RATE_COUNTER                                         0x00E8
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 11
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['debug_results', 'firmware_status']

	fields: \n
		- [11:0] = firmware_cal_repeat_rate
*/
#define VL53L1_FIRMWARE__CAL_REPEAT_RATE_COUNTER_HI                                      0x00E8
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_FIRMWARE__CAL_REPEAT_RATE_COUNTER_LO                                      0x00E9
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_FIRMWARE__HISTOGRAM_BIN                                                   0x00EA
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_GPH__SYSTEM__THRESH_HIGH                                                  0x00EC
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['debug_results', 'gph_actual']

	fields: \n
		- [15:0] = shadow_thresh_high
*/
#define VL53L1_GPH__SYSTEM__THRESH_HIGH_HI                                               0x00EC
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_GPH__SYSTEM__THRESH_HIGH_LO                                               0x00ED
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_GPH__SYSTEM__THRESH_LOW                                                   0x00EE
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['debug_results', 'gph_actual']

	fields: \n
		- [15:0] = shadow_thresh_low
*/
#define VL53L1_GPH__SYSTEM__THRESH_LOW_HI                                                0x00EE
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_GPH__SYSTEM__THRESH_LOW_LO                                                0x00EF
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_GPH__SYSTEM__ENABLE_XTALK_PER_QUADRANT                                    0x00F0
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'gph_actual']

	fields: \n
		-   [0] = shadow__enable_xtalk_per_quadrant
*/
#define VL53L1_GPH__SPARE_0                                                              0x00F1
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  2
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'gph_actual']

	fields: \n
		-   [0] = fw_safe_to_disable
		-   [1] = shadow__spare_0
		-   [2] = shadow__spare_1
*/
#define VL53L1_GPH__SD_CONFIG__WOI_SD0                                                   0x00F2
/*!<
	type:     uint8_t \n
	default:  0x04 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'gph_actual']

	fields: \n
		- [7:0] = shadow_sd_config__woi_sd0
*/
#define VL53L1_GPH__SD_CONFIG__WOI_SD1                                                   0x00F3
/*!<
	type:     uint8_t \n
	default:  0x04 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'gph_actual']

	fields: \n
		- [7:0] = shadow_sd_config__woi_sd1
*/
#define VL53L1_GPH__SD_CONFIG__INITIAL_PHASE_SD0                                         0x00F4
/*!<
	type:     uint8_t \n
	default:  0x03 \n
	info: \n
		- msb =  6
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'gph_actual']

	fields: \n
		- [6:0] = shadow_sd_config__initial_phase_sd0
*/
#define VL53L1_GPH__SD_CONFIG__INITIAL_PHASE_SD1                                         0x00F5
/*!<
	type:     uint8_t \n
	default:  0x03 \n
	info: \n
		- msb =  6
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'gph_actual']

	fields: \n
		- [6:0] = shadow_sd_config__initial_phase_sd1
*/
#define VL53L1_GPH__SD_CONFIG__FIRST_ORDER_SELECT                                        0x00F6
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  1
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'gph_actual']

	fields: \n
		-   [0] = shadow_sd_config__first_order_select_rtn
		-   [1] = shadow_sd_config__first_order_select_ref
*/
#define VL53L1_GPH__SD_CONFIG__QUANTIFIER                                                0x00F7
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  3
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'gph_actual']

	fields: \n
		- [3:0] = shadow_sd_config__quantifier
*/
#define VL53L1_GPH__ROI_CONFIG__USER_ROI_CENTRE_SPAD                                     0x00F8
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'gph_actual']

	fields: \n
		- [7:0] = shadow_user_roi_center_spad_q0
*/
#define VL53L1_GPH__ROI_CONFIG__USER_ROI_REQUESTED_GLOBAL_XY_SIZE                        0x00F9
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'gph_actual']

	fields: \n
		- [7:0] = shadow_user_roi_requested_global_xy_size
*/
#define VL53L1_GPH__SYSTEM__SEQUENCE_CONFIG                                              0x00FA
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'gph_actual']

	fields: \n
		-   [0] = shadow_sequence_vhv_en
		-   [1] = shadow_sequence_phasecal_en
		-   [2] = shadow_sequence_reference_phase_en
		-   [3] = shadow_sequence_dss1_en
		-   [4] = shadow_sequence_dss2_en
		-   [5] = shadow_sequence_mm1_en
		-   [6] = shadow_sequence_mm2_en
		-   [7] = shadow_sequence_range_en
*/
#define VL53L1_GPH__GPH_ID                                                               0x00FB
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'gph_actual']

	fields: \n
		-   [0] = shadow_gph_id
*/
#define VL53L1_SYSTEM__INTERRUPT_SET                                                     0x00FC
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  1
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'system_int_set']

	fields: \n
		-   [0] = sys_interrupt_set_range
		-   [1] = sys_interrupt_set_error
*/
#define VL53L1_INTERRUPT_MANAGER__ENABLES                                                0x00FD
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  4
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'interrupt_manager']

	fields: \n
		-   [0] = interrupt_enable__single_shot
		-   [1] = interrupt_enable__back_to_back
		-   [2] = interrupt_enable__timed
		-   [3] = interrupt_enable__abort
		-   [4] = interrupt_enable__test
*/
#define VL53L1_INTERRUPT_MANAGER__CLEAR                                                  0x00FE
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  4
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'interrupt_manager']

	fields: \n
		-   [0] = interrupt_clear__single_shot
		-   [1] = interrupt_clear__back_to_back
		-   [2] = interrupt_clear__timed
		-   [3] = interrupt_clear__abort
		-   [4] = interrupt_clear__test
*/
#define VL53L1_INTERRUPT_MANAGER__STATUS                                                 0x00FF
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  4
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'interrupt_manager']

	fields: \n
		-   [0] = interrupt_status__single_shot
		-   [1] = interrupt_status__back_to_back
		-   [2] = interrupt_status__timed
		-   [3] = interrupt_status__abort
		-   [4] = interrupt_status__test
*/
#define VL53L1_MCU_TO_HOST_BANK__WR_ACCESS_EN                                            0x0100
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'host_bank_ctrl']

	fields: \n
		-   [0] = mcu_to_host_bank_wr_en
*/
#define VL53L1_POWER_MANAGEMENT__GO1_RESET_STATUS                                        0x0101
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'power_man_status']

	fields: \n
		-   [0] = go1_status
*/
#define VL53L1_PAD_STARTUP_MODE__VALUE_RO                                                0x0102
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  1
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'pad_config']

	fields: \n
		-   [0] = pad_atest1_val_ro
		-   [1] = pad_atest2_val_ro
*/
#define VL53L1_PAD_STARTUP_MODE__VALUE_CTRL                                              0x0103
/*!<
	type:     uint8_t \n
	default:  0x30 \n
	info: \n
		- msb =  5
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'pad_config']

	fields: \n
		-   [0] = pad_atest1_val
		-   [1] = pad_atest2_val
		-   [4] = pad_atest1_dig_enable
		-   [5] = pad_atest2_dig_enable
*/
#define VL53L1_PLL_PERIOD_US                                                             0x0104
/*!<
	type:     uint32_t \n
	default:  0x00000000 \n
	info: \n
		- msb = 17
		- lsb =  0
		- i2c_size =  4

	groups: \n
		['debug_results', 'pll_config']

	fields: \n
		- [17:0] = pll_period_us (fixed point 0.24)
*/
#define VL53L1_PLL_PERIOD_US_3                                                           0x0104
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PLL_PERIOD_US_2                                                           0x0105
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PLL_PERIOD_US_1                                                           0x0106
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PLL_PERIOD_US_0                                                           0x0107
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_INTERRUPT_SCHEDULER__DATA_OUT                                             0x0108
/*!<
	type:     uint32_t \n
	default:  0x00000000 \n
	info: \n
		- msb = 31
		- lsb =  0
		- i2c_size =  4

	groups: \n
		['debug_results', 'debug_timer']

	fields: \n
		- [31:0] = interrupt_scheduler_data_out
*/
#define VL53L1_INTERRUPT_SCHEDULER__DATA_OUT_3                                           0x0108
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_INTERRUPT_SCHEDULER__DATA_OUT_2                                           0x0109
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_INTERRUPT_SCHEDULER__DATA_OUT_1                                           0x010A
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_INTERRUPT_SCHEDULER__DATA_OUT_0                                           0x010B
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_NVM_BIST__COMPLETE                                                        0x010C
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'nvm_bist_status']

	fields: \n
		-   [0] = nvm_bist__complete
*/
#define VL53L1_NVM_BIST__STATUS                                                          0x010D
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['debug_results', 'nvm_bist_status']

	fields: \n
		-   [0] = nvm_bist__status
*/
#define VL53L1_IDENTIFICATION__MODEL_ID                                                  0x010F
/*!<
	type:     uint8_t \n
	default:  0xEA \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'identification']

	fields: \n
		- [7:0] = model_id
*/
#define VL53L1_IDENTIFICATION__MODULE_TYPE                                               0x0110
/*!<
	type:     uint8_t \n
	default:  0xAA \n			---user: should be 0xCC
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'identification']

	fields: \n
		- [7:0] = module_type
*/
#define VL53L1_IDENTIFICATION__REVISION_ID                                               0x0111
/*!<
	type:     uint8_t \n
	default:  0x00 \n		---user: should be 0x10
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'identification']

	fields: \n
		- [3:0] = nvm_revision_id
		- [7:4] = mask_revision_id
*/
#define VL53L1_IDENTIFICATION__MODULE_ID                                                 0x0112
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['nvm_copy_data', 'identification']

	fields: \n
		- [15:0] = module_id
*/
#define VL53L1_IDENTIFICATION__MODULE_ID_HI                                              0x0112
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_IDENTIFICATION__MODULE_ID_LO                                              0x0113
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_ANA_CONFIG__FAST_OSC__TRIM_MAX                                            0x0114
/*!<
	type:     uint8_t \n
	default:  OSC_TRIM_DEFAULT \n
	info: \n
		- msb =  6
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'analog_config']

	fields: \n
		- [6:0] = osc_trim_max
*/
#define VL53L1_ANA_CONFIG__FAST_OSC__FREQ_SET                                            0x0115
/*!<
	type:     uint8_t \n
	default:  OSC_FREQ_SET_DEFAULT \n
	info: \n
		- msb =  2
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'analog_config']

	fields: \n
		- [2:0] = osc_freq_set
*/
#define VL53L1_ANA_CONFIG__VCSEL_TRIM                                                    0x0116
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  2
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'analog_config']

	fields: \n
		- [2:0] = vcsel_trim
*/
#define VL53L1_ANA_CONFIG__VCSEL_SELION                                                  0x0117
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  5
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'analog_config']

	fields: \n
		- [5:0] = vcsel_selion
*/
#define VL53L1_ANA_CONFIG__VCSEL_SELION_MAX                                              0x0118
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  5
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'analog_config']

	fields: \n
		- [5:0] = vcsel_selion_max
*/
#define VL53L1_PROTECTED_LASER_SAFETY__LOCK_BIT                                          0x0119
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'laser_safety']

	fields: \n
		-   [0] = laser_safety__lock_bit
*/
#define VL53L1_LASER_SAFETY__KEY                                                         0x011A
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  6
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'laser_safety']

	fields: \n
		- [6:0] = laser_safety__key
*/
#define VL53L1_LASER_SAFETY__KEY_RO                                                      0x011B
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'laser_safety']

	fields: \n
		-   [0] = laser_safety__key_ro
*/
#define VL53L1_LASER_SAFETY__CLIP                                                        0x011C
/*!<
	type:     uint8_t \n
	default:  0x02 \n
	info: \n
		- msb =  5
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'laser_safety']

	fields: \n
		- [5:0] = vcsel_pulse_width_clip
*/
#define VL53L1_LASER_SAFETY__MULT                                                        0x011D
/*!<
	type:     uint8_t \n
	default:  0x32 \n
	info: \n
		- msb =  5
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'laser_safety']

	fields: \n
		- [5:0] = vcsel_pulse_width_mult
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_0                                         0x011E
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'ret_spad_config']

	fields: \n
		- [7:0] = spad_enables_rtn_0
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_1                                         0x011F
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'ret_spad_config']

	fields: \n
		- [7:0] = spad_enables_rtn_1
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_2                                         0x0120
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'ret_spad_config']

	fields: \n
		- [7:0] = spad_enables_rtn_2
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_3                                         0x0121
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'ret_spad_config']

	fields: \n
		- [7:0] = spad_enables_rtn_3
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_4                                         0x0122
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'ret_spad_config']

	fields: \n
		- [7:0] = spad_enables_rtn_4
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_5                                         0x0123
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'ret_spad_config']

	fields: \n
		- [7:0] = spad_enables_rtn_5
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_6                                         0x0124
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'ret_spad_config']

	fields: \n
		- [7:0] = spad_enables_rtn_6
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_7                                         0x0125
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'ret_spad_config']

	fields: \n
		- [7:0] = spad_enables_rtn_7
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_8                                         0x0126
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'ret_spad_config']

	fields: \n
		- [7:0] = spad_enables_rtn_8
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_9                                         0x0127
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'ret_spad_config']

	fields: \n
		- [7:0] = spad_enables_rtn_9
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_10                                        0x0128
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'ret_spad_config']

	fields: \n
		- [7:0] = spad_enables_rtn_10
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_11                                        0x0129
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'ret_spad_config']

	fields: \n
		- [7:0] = spad_enables_rtn_11
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_12                                        0x012A
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'ret_spad_config']

	fields: \n
		- [7:0] = spad_enables_rtn_12
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_13                                        0x012B
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'ret_spad_config']

	fields: \n
		- [7:0] = spad_enables_rtn_13
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_14                                        0x012C
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'ret_spad_config']

	fields: \n
		- [7:0] = spad_enables_rtn_14
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_15                                        0x012D
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'ret_spad_config']

	fields: \n
		- [7:0] = spad_enables_rtn_15
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_16                                        0x012E
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'ret_spad_config']

	fields: \n
		- [7:0] = spad_enables_rtn_16
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_17                                        0x012F
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'ret_spad_config']

	fields: \n
		- [7:0] = spad_enables_rtn_17
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_18                                        0x0130
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'ret_spad_config']

	fields: \n
		- [7:0] = spad_enables_rtn_18
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_19                                        0x0131
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'ret_spad_config']

	fields: \n
		- [7:0] = spad_enables_rtn_19
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_20                                        0x0132
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'ret_spad_config']

	fields: \n
		- [7:0] = spad_enables_rtn_20
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_21                                        0x0133
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'ret_spad_config']

	fields: \n
		- [7:0] = spad_enables_rtn_21
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_22                                        0x0134
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'ret_spad_config']

	fields: \n
		- [7:0] = spad_enables_rtn_22
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_23                                        0x0135
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'ret_spad_config']

	fields: \n
		- [7:0] = spad_enables_rtn_23
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_24                                        0x0136
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'ret_spad_config']

	fields: \n
		- [7:0] = spad_enables_rtn_24
*/
#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_25                                        0x0137
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['nvm_copy_data', 'ret_spad_config']

