yatt122496/stm32_demo_std/模拟电磁曲射炮（全国大学生电子设计大赛）/HARDWARE/VL53L1X/core/vl53l1_register_map.h
	fields: \n
		- [15:0] = prev_shadow_result__final_crosstalk_corrected_range_mm_sd1
*/
#define VL53L1_PREV_SHADOW_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD1_HI             0x0EF2
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD1_LO             0x0EF3
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__SPARE_0_SD1                                           0x0EF4
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['prev_shadow_system_results', 'results']

	fields: \n
		- [15:0] = prev_shadow_result__spare_0_sd1
*/
#define VL53L1_PREV_SHADOW_RESULT__SPARE_0_SD1_HI                                        0x0EF4
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__SPARE_0_SD1_LO                                        0x0EF5
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__SPARE_1_SD1                                           0x0EF6
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['prev_shadow_system_results', 'results']

	fields: \n
		- [15:0] = prev_shadow_result__spare_1_sd1
*/
#define VL53L1_PREV_SHADOW_RESULT__SPARE_1_SD1_HI                                        0x0EF6
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__SPARE_1_SD1_LO                                        0x0EF7
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__SPARE_2_SD1                                           0x0EF8
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['prev_shadow_system_results', 'results']

	fields: \n
		- [15:0] = prev_shadow_result__spare_2_sd1
*/
#define VL53L1_PREV_SHADOW_RESULT__SPARE_2_SD1_HI                                        0x0EF8
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__SPARE_2_SD1_LO                                        0x0EF9
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__SPARE_3_SD1                                           0x0EFA
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['prev_shadow_system_results', 'results']

	fields: \n
		- [15:0] = prev_shadow_result__spare_3_sd1
*/
#define VL53L1_PREV_SHADOW_RESULT__SPARE_3_SD1_HI                                        0x0EFA
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT__SPARE_3_SD1_LO                                        0x0EFB
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0                        0x0EFC
/*!<
	type:     uint32_t \n
	default:  0x00000000 \n
	info: \n
		- msb = 31
		- lsb =  0
		- i2c_size =  4

	groups: \n
		['prev_shadow_core_results', 'ranging_core_results']

	fields: \n
		- [31:0] = prev_shadow_result_core__ambient_window_events_sd0
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0_3                      0x0EFC
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0_2                      0x0EFD
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0_1                      0x0EFE
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0_0                      0x0EFF
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0                         0x0F00
/*!<
	type:     uint32_t \n
	default:  0x00000000 \n
	info: \n
		- msb = 31
		- lsb =  0
		- i2c_size =  4

	groups: \n
		['prev_shadow_core_results', 'ranging_core_results']

	fields: \n
		- [31:0] = prev_shadow_result_core__ranging_total_events_sd0
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0_3                       0x0F00
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0_2                       0x0F01
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0_1                       0x0F02
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0_0                       0x0F03
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0                          0x0F04
/*!<
	type:     int32_t \n
	default:  0x00000000 \n
	info: \n
		- msb = 31
		- lsb =  0
		- i2c_size =  4

	groups: \n
		['prev_shadow_core_results', 'ranging_core_results']

	fields: \n
		- [31:0] = prev_shadow_result_core__signal_total_events_sd0
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0_3                        0x0F04
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0_2                        0x0F05
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0_1                        0x0F06
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0_0                        0x0F07
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0                        0x0F08
/*!<
	type:     uint32_t \n
	default:  0x00000000 \n
	info: \n
		- msb = 31
		- lsb =  0
		- i2c_size =  4

	groups: \n
		['prev_shadow_core_results', 'ranging_core_results']

	fields: \n
		- [31:0] = prev_shadow_result_core__total_periods_elapsed_sd0
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0_3                      0x0F08
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0_2                      0x0F09
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0_1                      0x0F0A
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0_0                      0x0F0B
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1                        0x0F0C
/*!<
	type:     uint32_t \n
	default:  0x00000000 \n
	info: \n
		- msb = 31
		- lsb =  0
		- i2c_size =  4

	groups: \n
		['prev_shadow_core_results', 'ranging_core_results']

	fields: \n
		- [31:0] = prev_shadow_result_core__ambient_window_events_sd1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1_3                      0x0F0C
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1_2                      0x0F0D
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1_1                      0x0F0E
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1_0                      0x0F0F
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1                         0x0F10
/*!<
	type:     uint32_t \n
	default:  0x00000000 \n
	info: \n
		- msb = 31
		- lsb =  0
		- i2c_size =  4

	groups: \n
		['prev_shadow_core_results', 'ranging_core_results']

	fields: \n
		- [31:0] = prev_shadow_result_core__ranging_total_events_sd1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1_3                       0x0F10
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1_2                       0x0F11
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1_1                       0x0F12
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1_0                       0x0F13
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1                          0x0F14
/*!<
	type:     int32_t \n
	default:  0x00000000 \n
	info: \n
		- msb = 31
		- lsb =  0
		- i2c_size =  4

	groups: \n
		['prev_shadow_core_results', 'ranging_core_results']

	fields: \n
		- [31:0] = prev_shadow_result_core__signal_total_events_sd1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1_3                        0x0F14
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1_2                        0x0F15
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1_1                        0x0F16
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1_0                        0x0F17
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1                        0x0F18
/*!<
	type:     uint32_t \n
	default:  0x00000000 \n
	info: \n
		- msb = 31
		- lsb =  0
		- i2c_size =  4

	groups: \n
		['prev_shadow_core_results', 'ranging_core_results']

	fields: \n
		- [31:0] = prev_shadow_result_core__total_periods_elapsed_sd1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1_3                      0x0F18
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1_2                      0x0F19
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1_1                      0x0F1A
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1_0                      0x0F1B
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PREV_SHADOW_RESULT_CORE__SPARE_0                                          0x0F1C
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['prev_shadow_core_results', 'ranging_core_results']

	fields: \n
		- [7:0] = prev_shadow_result_core__spare_0
*/
#define VL53L1_RESULT__DEBUG_STATUS                                                      0x0F20
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_debug', 'misc_results']

	fields: \n
		- [7:0] = result_debug_status
*/
#define VL53L1_RESULT__DEBUG_STAGE                                                       0x0F21
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_debug', 'misc_results']

	fields: \n
		- [7:0] = result_debug_stage
*/
#define VL53L1_GPH__SYSTEM__THRESH_RATE_HIGH                                             0x0F24
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['gph_general_config', 'dss_config']

	fields: \n
		- [15:0] = gph__system_thresh_rate_high (fixed point 9.7)
*/
#define VL53L1_GPH__SYSTEM__THRESH_RATE_HIGH_HI                                          0x0F24
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_GPH__SYSTEM__THRESH_RATE_HIGH_LO                                          0x0F25
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_GPH__SYSTEM__THRESH_RATE_LOW                                              0x0F26
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['gph_general_config', 'dss_config']

	fields: \n
		- [15:0] = gph__system_thresh_rate_low (fixed point 9.7)
*/
#define VL53L1_GPH__SYSTEM__THRESH_RATE_LOW_HI                                           0x0F26
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_GPH__SYSTEM__THRESH_RATE_LOW_LO                                           0x0F27
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_GPH__SYSTEM__INTERRUPT_CONFIG_GPIO                                        0x0F28
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['gph_general_config', 'gph_config']

	fields: \n
		- [1:0] = gph__int_mode_distance
		- [3:2] = gph__int_mode_rate
		-   [4] = gph__int_spare
		-   [5] = gph__int_new_measure_ready
		-   [6] = gph__int_no_target_en
		-   [7] = gph__int_combined_mode
*/
#define VL53L1_GPH__DSS_CONFIG__ROI_MODE_CONTROL                                         0x0F2F
/*!<
	type:     uint8_t \n
	default:  0x01 \n
	info: \n
		- msb =  2
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['gph_static_config', 'dss_config']

	fields: \n
		- [1:0] = gph__dss_config__input_mode
		-   [2] = gph__calculate_roi_enable
*/
#define VL53L1_GPH__DSS_CONFIG__MANUAL_EFFECTIVE_SPADS_SELECT                            0x0F30
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['gph_static_config', 'dss_config']

	fields: \n
		- [15:0] = gph__dss_config__manual_effective_spads_select
*/
#define VL53L1_GPH__DSS_CONFIG__MANUAL_EFFECTIVE_SPADS_SELECT_HI                         0x0F30
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_GPH__DSS_CONFIG__MANUAL_EFFECTIVE_SPADS_SELECT_LO                         0x0F31
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_GPH__DSS_CONFIG__MANUAL_BLOCK_SELECT                                      0x0F32
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['gph_static_config', 'dss_config']

	fields: \n
		- [7:0] = gph__dss_config__manual_block_select
*/
#define VL53L1_GPH__DSS_CONFIG__MAX_SPADS_LIMIT                                          0x0F33
/*!<
	type:     uint8_t \n
	default:  0xFF \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['gph_static_config', 'dss_config']

	fields: \n
		- [7:0] = gph__dss_config__max_spads_limit
*/
#define VL53L1_GPH__DSS_CONFIG__MIN_SPADS_LIMIT                                          0x0F34
/*!<
	type:     uint8_t \n
	default:  0x01 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['gph_static_config', 'dss_config']

	fields: \n
		- [7:0] = gph__dss_config__min_spads_limit
*/
#define VL53L1_GPH__MM_CONFIG__TIMEOUT_MACROP_A_HI                                       0x0F36
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  3
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['gph_timing_config', 'mm_config']

	fields: \n
		- [3:0] = gph_mm_config__config_timeout_macrop_a_hi
*/
#define VL53L1_GPH__MM_CONFIG__TIMEOUT_MACROP_A_LO                                       0x0F37
/*!<
	type:     uint8_t \n
	default:  0x06 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['gph_timing_config', 'mm_config']

	fields: \n
		- [7:0] = gph_mm_config__config_timeout_macrop_a_lo
*/
#define VL53L1_GPH__MM_CONFIG__TIMEOUT_MACROP_B_HI                                       0x0F38
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  3
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['gph_timing_config', 'mm_config']

	fields: \n
		- [3:0] = gph_mm_config__config_timeout_macrop_b_hi
*/
#define VL53L1_GPH__MM_CONFIG__TIMEOUT_MACROP_B_LO                                       0x0F39
/*!<
	type:     uint8_t \n
	default:  0x06 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['gph_timing_config', 'mm_config']

	fields: \n
		- [7:0] = gph_mm_config__config_timeout_macrop_b_lo
*/
#define VL53L1_GPH__RANGE_CONFIG__TIMEOUT_MACROP_A_HI                                    0x0F3A
/*!<
	type:     uint8_t \n
	default:  0x01 \n
	info: \n
		- msb =  3
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['gph_timing_config', 'range_config']

	fields: \n
		- [3:0] = gph_range_timeout_overall_periods_macrop_a_hi
*/
#define VL53L1_GPH__RANGE_CONFIG__TIMEOUT_MACROP_A_LO                                    0x0F3B
/*!<
	type:     uint8_t \n
	default:  0x92 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['gph_timing_config', 'range_config']

	fields: \n
		- [7:0] = gph_range_timeout_overall_periods_macrop_a_lo
*/
#define VL53L1_GPH__RANGE_CONFIG__VCSEL_PERIOD_A                                         0x0F3C
/*!<
	type:     uint8_t \n
	default:  0x0B \n
	info: \n
		- msb =  5
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['gph_timing_config', 'range_config']

	fields: \n
		- [5:0] = gph_range_config__vcsel_period_a
*/
#define VL53L1_GPH__RANGE_CONFIG__VCSEL_PERIOD_B                                         0x0F3D
/*!<
	type:     uint8_t \n
	default:  0x09 \n
	info: \n
		- msb =  5
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['gph_timing_config', 'range_config']

	fields: \n
		- [5:0] = gph_range_config__vcsel_period_b
*/
#define VL53L1_GPH__RANGE_CONFIG__TIMEOUT_MACROP_B_HI                                    0x0F3E
/*!<
	type:     uint8_t \n
	default:  0x01 \n
	info: \n
		- msb =  3
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['gph_timing_config', 'range_config']

	fields: \n
		- [3:0] = gph_range_timeout_overall_periods_macrop_b_hi
*/
#define VL53L1_GPH__RANGE_CONFIG__TIMEOUT_MACROP_B_LO                                    0x0F3F
/*!<
	type:     uint8_t \n
	default:  0x92 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['gph_timing_config', 'range_config']

	fields: \n
		- [7:0] = gph_range_timeout_overall_periods_macrop_b_lo
*/
#define VL53L1_GPH__RANGE_CONFIG__SIGMA_THRESH                                           0x0F40
/*!<
	type:     uint16_t \n
	default:  0x0080 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['gph_timing_config', 'range_config']

	fields: \n
		- [15:0] = gph_range_config__sigma_thresh (fixed point 14.2)
*/
#define VL53L1_GPH__RANGE_CONFIG__SIGMA_THRESH_HI                                        0x0F40
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_GPH__RANGE_CONFIG__SIGMA_THRESH_LO                                        0x0F41
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_GPH__RANGE_CONFIG__MIN_COUNT_RATE_RTN_LIMIT_MCPS                          0x0F42
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['gph_timing_config', 'range_config']

	fields: \n
		- [15:0] = gph_range_config__min_count_rate_rtn_limit_mcps (fixed point 9.7)
*/
#define VL53L1_GPH__RANGE_CONFIG__MIN_COUNT_RATE_RTN_LIMIT_MCPS_HI                       0x0F42
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_GPH__RANGE_CONFIG__MIN_COUNT_RATE_RTN_LIMIT_MCPS_LO                       0x0F43
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_GPH__RANGE_CONFIG__VALID_PHASE_LOW                                        0x0F44
/*!<
	type:     uint8_t \n
	default:  0x08 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['gph_timing_config', 'range_config']

	fields: \n
		- [7:0] = gph_range_config__valid_phase_low (fixed point 5.3)
*/
#define VL53L1_GPH__RANGE_CONFIG__VALID_PHASE_HIGH                                       0x0F45
/*!<
	type:     uint8_t \n
	default:  0x80 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['gph_timing_config', 'range_config']

	fields: \n
		- [7:0] = gph_range_config__valid_phase_high (fixed point 5.3)
*/
#define VL53L1_FIRMWARE__INTERNAL_STREAM_COUNT_DIV                                       0x0F46
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['fw_internal']

	fields: \n
		- [7:0] = fw__internal_stream_count_div
*/
#define VL53L1_FIRMWARE__INTERNAL_STREAM_COUNTER_VAL                                     0x0F47
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['fw_internal']

	fields: \n
		- [7:0] = fw__internal_stream_counter_val
*/
#define VL53L1_DSS_CALC__ROI_CTRL                                                        0x0F54
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  1
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		-   [0] = dss_calc__roi_intersect_enable
		-   [1] = dss_calc__roi_subtract_enable
*/
#define VL53L1_DSS_CALC__SPARE_1                                                         0x0F55
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__spare_1
*/
#define VL53L1_DSS_CALC__SPARE_2                                                         0x0F56
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__spare_2
*/
#define VL53L1_DSS_CALC__SPARE_3                                                         0x0F57
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__spare_3
*/
#define VL53L1_DSS_CALC__SPARE_4                                                         0x0F58
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__spare_4
*/
#define VL53L1_DSS_CALC__SPARE_5                                                         0x0F59
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__spare_5
*/
#define VL53L1_DSS_CALC__SPARE_6                                                         0x0F5A
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__spare_6
*/
#define VL53L1_DSS_CALC__SPARE_7                                                         0x0F5B
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__spare_7
*/
#define VL53L1_DSS_CALC__USER_ROI_SPAD_EN_0                                              0x0F5C
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__user_roi_spad_en_0
*/
#define VL53L1_DSS_CALC__USER_ROI_SPAD_EN_1                                              0x0F5D
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

